app/Controllers/API/ApiController.php

    public function getLantaiByGedung($id_gedung)
    {
        $data = $this->lantaiModel->where('id_gedung', $id_gedung)->findAll();
---
SELECT *
FROM `lantai`
WHERE `id_gedung` = '1'

    public function getPerangkatByLantai($id_lantai)
    {
        $db = \Config\Database::connect();

        // Ambil data perangkat terakhir (status terbaru) berdasarkan id_perangkat
        $subquery = $db->table('riwayat_perangkat')
            ->select('MAX(id_riwayat) as max_id')
            ->join('perangkat', 'perangkat.id_perangkat = riwayat_perangkat.id_perangkat')
            ->join('ruangan', 'ruangan.id_ruangan = perangkat.id_ruangan')
            ->where('ruangan.id_lantai', $id_lantai)
            ->groupBy('riwayat_perangkat.id_perangkat');

        $builder = $db->table('riwayat_perangkat');
        $builder->select('perangkat.id_perangkat, perangkat.nama_perangkat, perangkat.pos_x, perangkat.pos_y, riwayat_perangkat.status_perangkat');
        $builder->join('perangkat', 'perangkat.id_perangkat = riwayat_perangkat.id_perangkat');
        $builder->join('ruangan', 'ruangan.id_ruangan = perangkat.id_ruangan');
        $builder->where('ruangan.id_lantai', $id_lantai);
        $builder->whereIn('riwayat_perangkat.id_riwayat', $subquery);

        $result = $builder->get()->getResultArray();
---
SELECT `perangkat`.`id_perangkat`, `perangkat`.`nama_perangkat`, `perangkat`.`pos_x`, `perangkat`.`pos_y`, `riwayat_perangkat`.`status_perangkat`
FROM `perangkat`
JOIN `ruangan` ON `ruangan`.`id_ruangan` = `perangkat`.`id_ruangan`
JOIN `riwayat_perangkat` ON `riwayat_perangkat`.`id_perangkat` = `perangkat`.`id_perangkat`
WHERE `ruangan`.`id_lantai` = '1'