app/Controllers/AuthController.php

SELECT *
FROM `pengguna`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function doLogin()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new \App\Models\PenggunaModel();
        $user = $userModel->where('username', $username)->first();