app/Controllers/GedungController.php

SELECT `gedung`.*
FROM `gedung`
---
    public function index(): string
    {
        $model = new GedungModel();

        // Ambil semua data gedung dari tabel 'gedung'
        $dataGedung = $model
            ->select('gedung.*')
            ->findAll();