app/Controllers/Home.php

SELECT `gedung`.`id_gedung`, `gedung`.`nama_gedung`, `gedung`.`latitude`, `gedung`.`longitude`, `gedung`.`tipe`, `gedung`.`denah`
FROM `gedung`
SELECT `perangkat`.`id_perangkat`
FROM `perangkat`
JOIN `ruangan` ON `perangkat`.`id_ruangan` = `ruangan`.`id_ruangan`
JOIN `lantai` ON `ruangan`.`id_lantai` = `lantai`.`id_lantai`
WHERE `lantai`.`id_gedung` = '1'
---
    public function index(): string
    {
        $gedungModel    = new GedungModel();
        $perangkatModel = new PerangkatModel();
        $riwayatModel   = new RiwayatModel();

        // Ambil semua gedung
        $dataGedung = $gedungModel
            ->select('gedung.id_gedung, gedung.nama_gedung, gedung.latitude, gedung.longitude, gedung.tipe, gedung.denah')
            ->findAll();

        foreach ($dataGedung as &$gedung) {
            // Ambil perangkat berdasarkan gedung (melalui join ruangan dan lantai)
            $perangkatList = $perangkatModel
                ->select('perangkat.id_perangkat')
                ->join('ruangan', 'perangkat.id_ruangan = ruangan.id_ruangan')
                ->join('lantai', 'ruangan.id_lantai = lantai.id_lantai')
                ->where('lantai.id_gedung', $gedung['id_gedung'])
                ->findAll();