app/Controllers/Home.php

    public function index()
    {
        $gedungModel = new GedungModel();
        $data = [
            'judul' => 'Dashboard',
            'gedung' => $gedungModel->findAll()
---
SELECT *
FROM `gedung`