app/Controllers/LaporanController.php

SELECT *
FROM `kebencanaan`
SELECT `laporan`.*, `kebencanaan`.`jenis_bencana`
FROM `laporan`
JOIN `kebencanaan` ON `kebencanaan`.`id_kebencanaan` = `laporan`.`id_kebencanaan`
---
    public function index()
    {
        $laporan = $this->laporanModel
            ->select('laporan.*,
                      perangkat.nama_perangkat,
                      ruangan.nama_ruangan,
                      lantai.nama_lantai,
                      gedung.nama_gedung')
            ->join('perangkat', 'perangkat.id_perangkat = laporan.id_perangkat', 'left')
            ->join('ruangan', 'ruangan.id_ruangan = perangkat.id_ruangan', 'left')
            ->join('lantai', 'lantai.id_lantai = ruangan.id_lantai', 'left')
            ->join('gedung', 'gedung.id_gedung = ruangan.id_gedung', 'left')
            ->orderBy('laporan.waktu_laporan', 'DESC')
            ->findAll();

        $data = [
            'laporan' => $laporan,
            'judul' => 'Pelaporan',
            'gedung' => $this->gedungModel->findAll(),
            'lantai' => $this->lantaiModel->findAll(),
            'ruangan' => $this->ruanganModel->findAll(),
            'perangkat' => $this->perangkatModel->findAll(),
            'daftar_kebencanaan' => $this->kebencanaanModel->getJenisBencanaUnik(),
            'waktu_laporan'  => date('Y-m-d H:i:s'),
        ];