app/Controllers/PerangkatController.php

    public function index()
    {
        $dataPerangkat = $this->perangkatModel
            ->select('perangkat.*, ruangan.nama_ruangan, lantai.nama_lantai, gedung.nama_gedung')
            ->join('ruangan', 'perangkat.id_ruangan = ruangan.id_ruangan')
            ->join('lantai', 'ruangan.id_lantai = lantai.id_lantai')
            ->join('gedung', 'ruangan.id_gedung = gedung.id_gedung')
            ->findAll();

        $data = [
            'judul' => 'Data Perangkat',
            'perangkat' => $dataPerangkat,
            'gedung' => $this->gedungModel->findAll(),
            'daftar_ruangan' => $this->ruanganModel->findAll(),
        ];
---
SELECT `perangkat`.*, `ruangan`.`nama_ruangan`, `lantai`.`nama_lantai`, `gedung`.`nama_gedung`
FROM `perangkat`
JOIN `ruangan` ON `perangkat`.`id_ruangan` = `ruangan`.`id_ruangan`
JOIN `lantai` ON `ruangan`.`id_lantai` = `lantai`.`id_lantai`
JOIN `gedung` ON `ruangan`.`id_gedung` = `gedung`.`id_gedung`
SELECT *
FROM `gedung`
SELECT *
FROM `ruangan`

    public function simpan()
    {
        if (!$this->validate([
            'nama_perangkat'   => 'required',
            'id_ruangan'       => 'required|integer',
            'jenis_perangkat'  => 'required',
            'pos_x'            => 'required',
            'pos_y'            => 'required',
        ])) {
            return redirect()->back()->withInput()->with('error', 'Data tidak valid. Pastikan semua field terisi, termasuk posisi pada denah.');
        }

        $data = [
            'nama_perangkat'   => $this->request->getPost('nama_perangkat'),
            'id_ruangan'       => $this->request->getPost('id_ruangan'),
            'jenis_perangkat'  => $this->request->getPost('jenis_perangkat'),
            'latitude'         => null,
            'longitude'        => null,
            'pos_x'            => $this->request->getPost('pos_x'),
            'pos_y'            => $this->request->getPost('pos_y'),
        ];

        $this->perangkatModel->insert($data);
---
INSERT INTO `perangkat` (`nama_perangkat`, `id_ruangan`, `jenis_perangkat`, `latitude`, `longitude`, `update_at`) VALUES ('sensor3', '1', 'sensor', NULL, NULL, '2025-05-20 14:36:56')