app/Controllers/PerangkatController.php

SELECT *
FROM `perangkat`
WHERE `perangkat`.`id_perangkat` = '40'
DELETE FROM `kebencanaan`
WHERE `id_perangkat` = '40'
DELETE FROM `perangkat`
WHERE `id_perangkat` IN ('40')
---
    public function hapus($id)
    {
        $perangkat = $this->perangkatModel->find($id);
        if (!$perangkat) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Perangkat tidak ditemukan.']);
        }

        try {
            $this->kebencanaanModel->where('id_perangkat', $id)->delete();
        } catch (\Exception $e) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Gagal menghapus data terkait di tabel kebencanaan: ' . $e->getMessage()]);
        }

        try {
            $this->riwayatModel->where('id_perangkat', $id)->delete();