app/Controllers/RiwayatController.php

    public function index()
    {
        $filters = $this->request->getGet();
        $riwayatModel = new RiwayatModel();
        $kebencanaanModel = new KebencanaanModel();

        $data = [
            'judul'        => 'Riwayat Perangkat',
            'riwayat'      => $riwayatModel->getFilteredRiwayat($filters),
            'gedung'       => (new GedungModel())->findAll(),
            'lantai'       => (new LantaiModel())->findAll(),
            'ruangan'      => (new RuanganModel())->findAll(),
---
SELECT *
FROM `gedung`
SELECT *
FROM `lantai`
SELECT *
FROM `ruangan`