app/Models/KebencanaanModel.php

SELECT `jenis_bencana`
FROM `kebencanaan`
GROUP BY `jenis_bencana`
ORDER BY `jenis_bencana` ASC
---
    public function getJenisBencanaUnik()
    {
        return $this->select('jenis_bencana')
            ->groupBy('jenis_bencana')
            ->orderBy('jenis_bencana', 'ASC')
            ->findAll();